import { TreeNode } from 'primeng/api';

export const industryData: TreeNode[] = [
  {
    key: '1',
    label: '1. โรงงานประกอบกิจการเกี่ยวกับการบ่มใบชาหรือใบยาสูบ',
    children: []
  },
  {
    key: '2',
    label: '2. โรงงานประกอบกิจการเกี่ยวกับผลิตผลเกษตรกรรม',
    children: [
      { key: '2-1', label: 'การต้ม นึ่ง หรืออบพืชหรือเมล็ดพืช', children: [] },
      { key: '2-2', label: 'การกะเทาะเมล็ด หรือเปลือกเมล็ดพืช', children: [] },
      { key: '2-3', label: 'การอัดปอหรือใบยาสูบ', children: [] },
      // เพิ่ม children อื่น ๆ ที่นี่
    ]
  },
  {
    key: '3',
    label: '3. โรงงานประกอบกิจการเกี่ยวกับหิน กรวด ทราย หรือดินสำหรับใช้ในการก่อสร้าง',
    children: [
      { key: '3-1', label: 'การโม่ บด หรือย่อยหิน', children: [] },
      { key: '3-2', label: 'การขุดหรือลอก กรวด ทราย หรือดิน', children: [] },
      { key: '3-3', label: 'การร่อนหรือคัดกรวดหรือทราย', children: [] },
      // เพิ่ม children อื่น ๆ ที่นี่
    ]
  }
];
